package Lesson1_Hometask;

public class Zad1 {
    //Задача 1:
    //Создать программу, которая будет выводить в консоли Ваше имя и фамилию.

    public static void main(String[] args) {
        print_name();
        print_surname();
    }

    public static void print_name() {
        System.out.println("Rita");
    }

    public static void print_surname() {
        System.out.println("Osipenko");
    }
}