package Lesson3_Hometask;

    //Составьте программу, выводящую на экран квадраты чисел от 10 до 20 включительно.
public class Zad2_3 {
    public static void main(String[] args) {
        for(int i=10;i<=20;i++){
            System.out.println(i + " squared " + i*i);
        }
    }
}
